renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_memdrv_rx/src/r_memdrv_dmac.c
    if (R_DMACA_Int_Callback(MEMDRV_CFG_DEV1_DMAC_CH_NO_Tx,
                             (void *)r_memdrv_dmac_callback_tx_dev1) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    if (R_DMACA_Int_Enable(MEMDRV_CFG_DEV1_DMAC_CH_NO_Tx,
                           MEMDRV_CFG_DEV1_DMAC_INT_PRL_Tx) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    /* Rx setting */
    if (R_DMACA_Open(MEMDRV_CFG_DEV1_DMAC_CH_NO_Rx) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    if (R_DMACA_Int_Callback(MEMDRV_CFG_DEV1_DMAC_CH_NO_Rx,
                             (void *)r_memdrv_dmac_callback_rx_dev1) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    if (R_DMACA_Int_Enable(MEMDRV_CFG_DEV1_DMAC_CH_NO_Rx,
                           MEMDRV_CFG_DEV1_DMAC_INT_PRL_Rx) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

#endif /* MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_dmac_open() */

#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
/************************************************************************************************
* Function Name: r_memdrv_dmac_callback_tx_dev0
* Description  : Callback function for DMAC transmission for device 0.
* Arguments    : None
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static void r_memdrv_dmac_callback_tx_dev0(void)
{
    uint8_t channel = r_memdrv_get_drv_ch(MEMDRV_DEV0);
    dmaca_stat_t stat_dmac;

    if (R_DMACA_Control(MEMDRV_CFG_DEV0_DMAC_CH_NO_Tx,
                        DMACA_CMD_STATUS_GET, 
                        &stat_dmac) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return;
    }

    if (true == (stat_dmac.dtif_stat))
    {
        if (R_DMACA_Control(MEMDRV_CFG_DEV0_DMAC_CH_NO_Tx,
                            DMACA_CMD_DTIF_STATUS_CLR,
                            &stat_dmac) != DMACA_SUCCESS)
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return;
        }
        R_MEMDRV_ClearDMACFlagTx(channel);
    }

    if (true == (stat_dmac.esif_stat))
    {
        if (R_DMACA_Control(MEMDRV_CFG_DEV0_DMAC_CH_NO_Tx,
                            DMACA_CMD_ESIF_STATUS_CLR,
                            &stat_dmac) != DMACA_SUCCESS)
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return;
        }
    }
    return;
} /* End of function r_memdrv_dmac_callback_tx_dev0() */

/************************************************************************************************
* Function Name: r_memdrv_dmac_callback_rx_dev0
* Description  : Callback function for DMAC reception for device 0.
* Arguments    : None
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static void r_memdrv_dmac_callback_rx_dev0(void)
{
    uint8_t channel = r_memdrv_get_drv_ch(MEMDRV_DEV0);
    dmaca_stat_t stat_dmac;

    if (R_DMACA_Control(MEMDRV_CFG_DEV0_DMAC_CH_NO_Rx,
                        DMACA_CMD_STATUS_GET, 
                        &stat_dmac) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return;
    }

    if (true == (stat_dmac.dtif_stat))
    {
        if (R_DMACA_Control(MEMDRV_CFG_DEV0_DMAC_CH_NO_Rx,
                            DMACA_CMD_DTIF_STATUS_CLR,
                            &stat_dmac) != DMACA_SUCCESS)
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return;
        }
        R_MEMDRV_ClearDMACFlagRx(channel);
    }

    if (true == (stat_dmac.esif_stat))
    {
        if (R_DMACA_Control(MEMDRV_CFG_DEV0_DMAC_CH_NO_Rx,
                            DMACA_CMD_ESIF_STATUS_CLR,
                            &stat_dmac) != DMACA_SUCCESS)
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return;
        }
    }
    return;
} /* End of function r_memdrv_dmac_callback_rx_dev0() */
#endif /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC) */

#if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
/************************************************************************************************
* Function Name: r_memdrv_dmac_callback_tx_dev1
* Description  : Callback function for DMAC transmission for device 1.
* Arguments    : None
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static void r_memdrv_dmac_callback_tx_dev1(void)
{
    uint8_t channel = r_memdrv_get_drv_ch(MEMDRV_DEV0);
    dmaca_stat_t stat_dmac;

    if (R_DMACA_Control(MEMDRV_CFG_DEV1_DMAC_CH_NO_Tx,
                        DMACA_CMD_STATUS_GET, 
                        &stat_dmac) != DMACA_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return;
    }

    if (true == (stat_dmac.dtif_stat))
    {
        if (R_DMACA_Control(MEMDRV_CFG_DEV1_DMAC_CH_NO_Tx,
                            DMACA_CMD_DTIF_STATUS_CLR,
                            &stat_dmac) != DMACA_SUCCESS)
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return;
        }
        R_MEMDRV_ClearDMACFlagTx(channel);
    }

